backend/app/controllers/api/v1/auth/switch_controller.rb

        def create
          target_user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]