backend/app/controllers/api/v1/contracts_controller.rb

      def index
        from_date = params[:from].present? ? parse_year_month(params[:from]) : Date.current.beginning_of_month
        to_date   = params[:to].present?   ? parse_year_month(params[:to])   : from_date + 11.months

        display_months = (from_date..to_date).select { |d| d.day == 1 }.map { |d| d.strftime("%Y-%m") }

        contracts = current_user.contracts
          .where("period_start <= ? AND period_end >= ?", to_date, from_date)
          .includes(:contract_month_statuses)
          .order(:period_start)

        render json: {
          display_months: display_months,
          contracts: contracts.map { |c| contract_json(c, from_date, to_date) }
---
SELECT "contract_month_statuses".* FROM "contract_month_statuses" WHERE "contract_month_statuses"."contract_id" IN ($1, $2)  [["contract_id", 1], ["contract_id", 2]]
SELECT "contracts".* FROM "contracts" WHERE "contracts"."user_id" = $1 AND (period_start <= $2 AND period_end >= $3) ORDER BY "contracts"."period_start" DESC LIMIT $4  [["user_id", 1], [nil, "2026-03-01"], [nil, "2026-03-01"], ["LIMIT", 1]]
SELECT "contracts".* FROM "contracts" WHERE "contracts"."user_id" = $1 AND (period_start <= $2 AND period_end >= $3) ORDER BY "contracts"."period_start" ASC  [["user_id", 1], [nil, "2027-02-01"], [nil, "2026-03-01"]]