backend/app/controllers/api/v1/dashboard_controller.rb

SELECT "contracts".* FROM "contracts" WHERE "contracts"."user_id" = $1 AND (period_start <= $2 AND period_end >= $3) ORDER BY "contracts"."period_start" DESC LIMIT $4  [["user_id", 1], [nil, "2026-03-01"], [nil, "2026-03-01"], ["LIMIT", 1]]
---
      def show
        current_month = Date.current.beginning_of_month

        active_contract = current_user.contracts
          .where("period_start <= ? AND period_end >= ?", current_month, current_month)
          .order(period_start: :desc)
          .first