backend/app/controllers/api/v1/return_rate_trends_controller.rb

      def index
        trends = current_user.return_rate_trends.order(:year_month)
        trends = trends.where("year_month >= ?", parse_year_month(params[:from])) if params[:from].present?
        trends = trends.where("year_month <= ?", parse_year_month(params[:to])) if params[:to].present?

        render json: {
          user: user_json(current_user),
          trends: trends.map { |t|
---
SELECT "return_rate_trends".* FROM "return_rate_trends" WHERE "return_rate_trends"."user_id" = $1 AND (year_month >= $2) AND (year_month <= $3) ORDER BY "return_rate_trends"."year_month" ASC  [["user_id", 325], [nil, "2025-05-01"], [nil, "2025-05-01"]]