backend/app/controllers/api/v1/sales_trends_controller.rb

SELECT "sales_trends".* FROM "sales_trends" WHERE "sales_trends"."user_id" = $1 AND (year_month >= $2) AND (year_month <= $3) ORDER BY "sales_trends"."year_month" ASC  [["user_id", 335], [nil, "2025-05-01"], [nil, "2025-05-01"]]
---
      def index
        trends = current_user.sales_trends.order(:year_month)
        trends = trends.where("year_month >= ?", parse_year_month(params[:from])) if params[:from].present?
        trends = trends.where("year_month <= ?", parse_year_month(params[:to])) if params[:to].present?

        render json: {
          user: user_json(current_user),
          trends: trends.map { |t|