backend/app/controllers/api/v1/users_controller.rb

      def index
        users = User.order(:id).select(:id, :name, :email)
        render json: users.map { |u| { id: u.id, name: u.name, email: u.email } }
---
SELECT "users"."id", "users"."name", "users"."email" FROM "users" ORDER BY "users"."id" ASC